Documents/ЗакрытиеЛицевогоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЗакрытиеЛицевогоСчета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.НазначенныеЛьготы</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслугиПодробно</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.ЛицевыеСчета</xr:Item>
				<xr:Item>InformationRegister.ДополнительныеРеквизитыЛицевогоСчета</xr:Item>
				<xr:Item>InformationRegister.УстановленныеПриборыУчета</xr:Item>
				<xr:Item>InformationRegister.МашиноМеста</xr:Item>
				<xr:Item>InformationRegister.СведенияОПрописанныхЖильцах</xr:Item>
				<xr:Item>InformationRegister.СведенияОПроживающихЖильцах</xr:Item>
				<xr:Item>InformationRegister.НазначенныеСубсидии</xr:Item>
				<xr:Item>InformationRegister.ОтветственныйВладелецЛицевогоСчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/НазначенныеСубсидии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеСубсидии</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГраницаСубсидии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурсная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслуги</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеУслугиПодробно.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеУслугиПодробно</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаПодробно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиСДПТПодробно</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НазначенныеЛьготы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>НазначенныеЛьготы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЧленовСемьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоциальнаяНормаНаЛьготника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СоциальнаяНормаНаСемью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПотребительУслуг</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Льгота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Льготы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОПрописанныхЖильцах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПрописанныхЖильцах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Прописан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СведенияОПроживающихЖильцах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СведенияОПроживающихЖильцах</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Проживает</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Жилец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЗакрытиеЛицевогоСчета/Ext/ManagerModule.bsl
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаЗакрытиеЛицевогоСчета, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛицевыеСчетаСрезПоследних.ЛицевойСчет,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК ЛицевыеСчетаСрезПоследних
	|ГДЕ
	|	ЛицевыеСчетаСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеСубсидииСрезПоследних.ЛицевойСчет,
	|	НазначенныеСубсидииСрезПоследних.Услуга,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.НазначенныеСубсидии.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеСубсидииСрезПоследних
	|ГДЕ
	|	НазначенныеСубсидииСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеУслугиСрезПоследних.Организация,
	|	НазначенныеУслугиСрезПоследних.ЛицевойСчет,
	|	НазначенныеУслугиСрезПоследних.Услуга,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеУслугиСрезПоследних
	|ГДЕ
	|	НазначенныеУслугиСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки,
	|	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ОбъектУстановки = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК УстановленныеПриборыУчетаСрезПоследних
	|ГДЕ
	|	УстановленныеПриборыУчетаСрезПоследних.Действует = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеУслугиПодробноСрезПоследних.Организация,
	|	НазначенныеУслугиПодробноСрезПоследних.ЛицевойСчет,
	|	НазначенныеУслугиПодробноСрезПоследних.Услуга,
	|	НазначенныеУслугиПодробноСрезПоследних.УслугаПодробно,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.НазначенныеУслугиПодробно.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеУслугиПодробноСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НазначенныеЛьготыСрезПоследних.ПотребительУслуг,
	|	НазначенныеЛьготыСрезПоследних.Льгота,
	|	НазначенныеЛьготыСрезПоследних.Услуга,
	|	ЛОЖЬ КАК Действует,
	|	&ДатаДокумента КАК Период,
	|	НазначенныеЛьготыСрезПоследних.ЛицевойСчет
	|ИЗ
	|	РегистрСведений.НазначенныеЛьготы.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК НазначенныеЛьготыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныйВладелецЛицевогоСчетаСрезПоследних.ЛицевойСчет,
	|	&ДатаДокумента КАК Период,
	|	ЗНАЧЕНИЕ(Справочник.ПотребителиУслуг.ПустаяСсылка) КАК ОтветственныйВладелец
	|ИЗ
	|	РегистрСведений.ОтветственныйВладелецЛицевогоСчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК ОтветственныйВладелецЛицевогоСчетаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОПрописанныхЖильцахСрезПоследних.ЛицевойСчет,
	|	СведенияОПрописанныхЖильцахСрезПоследних.Жилец,
	|	ЛОЖЬ КАК Прописан,
	|	&ДатаДокумента КАК Период
	|ИЗ
	|	РегистрСведений.СведенияОПрописанныхЖильцах.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК СведенияОПрописанныхЖильцахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СведенияОПроживающихЖильцахСрезПоследних.ЛицевойСчет,
	|	СведенияОПроживающихЖильцахСрезПоследних.Жилец,
	|	&ДатаДокумента КАК Период,
	|	ЛОЖЬ КАК Проживает
	|ИЗ
	|	РегистрСведений.СведенияОПроживающихЖильцах.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК СведенияОПроживающихЖильцахСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МашиноМестаСрезПоследних.ЛицевойСчет,
	|	МашиноМестаСрезПоследних.ВидМашиноМеста,
	|	&ДатаДокумента КАК Период,
	|	"""" КАК НомерМашиноМеста,
	|	0 КАК КоличествоМашиноМест
	|ИЗ
	|	РегистрСведений.МашиноМеста.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК МашиноМестаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДополнительныеРеквизитыЛицевогоСчетаСрезПоследних.ЛицевойСчет,
	|	ДополнительныеРеквизитыЛицевогоСчетаСрезПоследних.ДополнительныйРеквизит,
	|	&ДатаДокумента КАК Период,
	|	0 КАК Значение
	|ИЗ
	|	РегистрСведений.ДополнительныеРеквизитыЛицевогоСчета.СрезПоследних(
	|			&ДатаДокумента,
	|			ЛицевойСчет = &ЛицевойСчет
	|				И Регистратор <> &Ссылка) КАК ДополнительныеРеквизитыЛицевогоСчетаСрезПоследних";
	 
	Запрос.УстановитьПараметр("ДатаДокумента", НачалоДня(ДокументСсылкаЗакрытиеЛицевогоСчета.Дата));
	Запрос.УстановитьПараметр("ЛицевойСчет", ДокументСсылкаЗакрытиеЛицевогоСчета.ЛицевойСчет);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗакрытиеЛицевогоСчета);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЛицевыеСчета", РезультатЗапроса[0].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеСубсидии", РезультатЗапроса[1].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслуги", РезультатЗапроса[2].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУстановленныеПриборыУчета", РезультатЗапроса[3].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеУслугиПодробно", РезультатЗапроса[4].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаНазначенныеЛьготы", РезультатЗапроса[5].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаОтветственныйВладелецЛицевогоСчета", РезультатЗапроса[6].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПрописанныхЖильцах", РезультатЗапроса[7].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСведенияОПроживающихЖильцах", РезультатЗапроса[8].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаМашиноМеста", РезультатЗапроса[9].Выгрузить());
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДополнительныеРеквизитыЛицевогоСчета", РезультатЗапроса[10].Выгрузить());
	
КонецПроцедуры
